In [1]:
from zipfile import ZipFile

import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

In [8]:
with ZipFile('Data/meal_delivery_archive.zip') as zipArchive:
    with zipArchive.open('train.csv') as f:
        raw = pd.read_csv(f)
        
raw.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,1379560,1,55,1885,136.83,152.29,0,0,177
1,1466964,1,55,1993,136.83,135.83,0,0,270
2,1346989,1,55,2539,134.86,135.86,0,0,189
3,1338232,1,55,2139,339.50,437.53,0,0,54
4,1448490,1,55,2631,243.50,242.50,0,0,40

First, let's check how many meal delivery centers are in the dataset (represented by center_id) and how many unique meals are served.

In [12]:
len(raw.center_id.unique())

77

In [13]:
len(raw.meal_id.unique())

51

In [45]:
len(raw.week.unique())

145

In [48]:
data = raw.loc[:, ['week', 'center_id', 'meal_id', 'num_orders']].copy()

In [49]:
data.head()

   week  center_id  meal_id  num_orders
0     1         55     1885         177
1     1         55     1993         270
2     1         55     2539         189
3     1         55     2139          54
4     1         55     2631          40

I think I need to treat this as a vector-valued time series; input any given week number, and you want to get back an output with a tuple of $77*51$ values which represent the number of orders placed for a particular meal that week by a given center.